# Quiz #6

In [2]:
import pandas as pd

In [3]:
income_df = pd.read_csv("Income_Categorical.csv")
income_df.head(3)

   INCOME  AGE  GENDER  HOURS_working       JOB_TYPE  EXPERIECE_in_YEARS
0   <=50K   20       1             44          Sales                   5
1    >50K   31       3             38          Sales                  21
2   <=50K   24       1             50   Tech-support                   6

In [4]:
# Create features and target sets
x_income, y_income = income_df.iloc[:,1:], income_df["INCOME"]
# Check our work
display(x_income.head(3))
display(y_income.head(3))

   AGE  GENDER  HOURS_working       JOB_TYPE  EXPERIECE_in_YEARS
0   20       1             44          Sales                   5
1   31       3             38          Sales                  21
2   24       1             50   Tech-support                   6

0     <=50K
1      >50K
2     <=50K
Name: INCOME, dtype: object

In [13]:
# Original Categorical Features dropped
# the order of colums is as follow:
#   - original numberic cols go first, followed by newly created binary vars
x_income["GENDER"] = x_income["GENDER"].astype(str)
x_dummies = pd.get_dummies(x_income)
x_dummies.head(3)

,AGE,HOURS_working,EXPERIECE_in_YEARS,GENDER_1,GENDER_2,GENDER_3,JOB_TYPE_ Sales,JOB_TYPE_ Tech-support
0,20,44,5,1,0,0,1,0
1,31,38,21,0,0,1,1,0
2,24,50,6,1,0,0,0,1

In [23]:
x_dummies.describe()

,AGE,HOURS_working,EXPERIECE_in_YEARS,GENDER_1,GENDER_2,GENDER_3,JOB_TYPE_ Sales,JOB_TYPE_ Tech-support
count,2217.000000,2217.000000,2217.000000,2217.000000,2217.000000,2217.000000,2217.000000,2217.000000
mean,36.355886,41.091114,9.035183,0.289581,0.404601,0.305819,0.785747,0.214253
std,12.891981,12.126097,6.143194,0.453670,0.490925,0.460857,0.410396,0.410396
min,18.000000,2.000000,3.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,26.000000,40.000000,5.000000,0.000000,0.000000,0.000000,1.000000,0.000000
50%,35.000000,40.000000,7.000000,0.000000,0.000000,0.000000,1.000000,0.000000
75%,45.000000,50.000000,11.000000,1.000000,1.000000,1.000000,1.000000,0.000000
max,90.000000,99.000000,25.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [32]:
d = x_dummies["HOURS_working"].mean()
d.round(2)

41.09

In [14]:
from sklearn.model_selection import train_test_split
from sklearn.neighbors import KNeighborsClassifier

In [15]:
# split data to train and test (80/20)
# ----- use x_dummbies and y_income in train_test_split function
# we define a KNN w/ 9 neighbors
# fit the model using training data
# evaluate the performance
# split data to train and test (75/25)
x_train, x_test, y_train, y_test = train_test_split(x_dummies, y_income, test_size=.2, random_state=0)

print(x_train.shape)
print(x_test.shape)
print(y_train.shape)
print(y_test.shape)

(1773, 8)
(444, 8)
(1773,)
(444,)

In [16]:
# define the model
knn_cls = KNeighborsClassifier(n_neighbors=9)

# fit (train) the model -- we pass both features and target sets
# we use fit() method to fit a model
knn_cls.fit(x_train, y_train)

KNeighborsClassifier(n_neighbors=9)

In [17]:
# we evaluate our model's performance
# we use score() method
print("knn accuracy on train: {:.2%}".format(knn_cls.score(x_train, y_train)))
print("knn accuracy on test: {:.2%}".format(knn_cls.score(x_test, y_test)))

knn accuracy on train: 94.75%
knn accuracy on test: 95.72%

In [18]:
x_train.head(3)

,AGE,HOURS_working,EXPERIECE_in_YEARS,GENDER_1,GENDER_2,GENDER_3,JOB_TYPE_ Sales,JOB_TYPE_ Tech-support
1809,49,40,9,1,0,0,1,0
15,27,40,5,1,0,0,1,0
1507,36,40,3,1,0,0,0,1

In [20]:
# make predictions
# we use predict() method -- it only takes features
# must make predictions in same way we trained model (with dummy variables)
p1 = [35, 40, 10, 1, 0, 0, 1, 0]
p2 = [23, 35, 3, 0, 1, 0, 0, 1]
p3 = [45, 38, 12, 0, 0, 1, 0, 1]
knn_cls.predict([p1, p2, p3])

/Users/ryanmaki/opt/anaconda3/lib/python3.9/site-packages/sklearn/base.py:450: UserWarning: X does not have valid feature names, but KNeighborsClassifier was fitted with feature names
  warnings.warn(

array([' <=50K', ' <=50K', ' >50K'], dtype=object)